Repository: bragin/syllable
Catalog: system/apps/gnu/textutils-2.0.21/po/*.po
Languages: tr

source: invalid argument %s for %s
tr: %s argümaný `%s' için geçersiz

source: ambiguous argument %s for %s
tr: %s argümaný `%s' için belirsiz

source: Valid arguments are:
tr: Geçerli argümanlar:

source: write error
tr: yazma hatasý

source: Unknown system error
tr: Bilinmeyen sistem hatasý

source: %s: option `%s' is ambiguous
tr: %s: `%s' seçeneði belirsiz

source: %s: option `--%s' doesn't allow an argument
tr: %s: `--%s' seçeneði argümansýz kullanýlýr

source: %s: option `%c%s' doesn't allow an argument
tr: %s: seçenek `%c%s' argümansýz kullanýlýr

source: %s: option `%s' requires an argument
tr: %s: `%s' seçeneði bir argümanla kullanýlýr

source: %s: unrecognized option `--%s'
tr: %s: `--%s' seçeneði bilinmiyor

source: %s: unrecognized option `%c%s'
tr: %s: `%c%s' seçeneði bilinmiyor

source: %s: illegal option -- %c
tr: %s: kuraldýþý seçenek -- %c

source: %s: invalid option -- %c
tr: %s: geçersiz seçenek -- %c

source: %s: option requires an argument -- %c
tr: %s: seçenek bir argümanla kullanýlýr -- %c

source: %s: option `-W %s' is ambiguous
tr: %s: `-W %s' seçeneði belirsiz

source: %s: option `-W %s' doesn't allow an argument
tr: %s: `-W %s' seçeneði argümansýz kullanýlýr

source: block size
tr: blok uzunluðu

source: cannot create directory %s
tr: %s dizini oluþturulamýyor

source: %s exists but is not a directory
tr: %s var ama bir dizin deðil

source: cannot change owner and/or group of %s
tr: %s'in sahibi ve/veya grubu deðiþtirilemiyor

source: cannot chdir to directory, %s
tr: %s dizinine geçilemedi

source: cannot change permissions of %s
tr: %s'in eriþim izinleri deðiþtirilemiyor

source: memory exhausted
tr: bellek tükendi

source: ^[yY]
tr: ^[eE]

source: ^[nN]
tr: ^[hH]

source: cannot convert U+%04X to local character set
tr: U+%04X yerel karakter kümesine dönüþtürülemiyor

source: invalid user
tr: kullanýcý geçersiz

source: invalid group
tr: grup geçersiz

source: cannot get the login group of a numeric UID
tr: bir sayýsal kullanýcý-kimliðin grubu alýnamýyor

source: cannot omit both user and group
tr: kullanýcý ve grubun her ikisi birden atlanamaz

source: Written by %s.
tr: %s tarafýndan yazýldý.

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
tr: Bu bir serbest yazýlýmdýr; kopyalama koþullarý için kaynak koduna bakýnýz. Hiçbir garantisi yoktur; hatta SATILABÝLÝRLÝÐÝ veya HERHANGÝ BÝR AMACA UYGUNLUÐU için bile garanti verilmez.

source: string comparison failed
tr: dizge (string) karþýlaþtýrmasý baþarýsýz

source: Set LC_ALL='C' to work around the problem.
tr: LC_ALL çevre deðiþkenini C deðerine eþitleyerek sorunu halledebilirsiniz

source: The strings compared were %s and %s.
tr: Karþýlaþtýrýlan dizgeler: %s ve %s idi

source: Torbjorn Granlund and Richard M. Stallman
tr: Torbjorn Granlund ve Richard M. Stallman

source: Try `%s --help' for more information.
tr: Daha fazla bilgi için `%s --help' yazýn.

source: Usage: %s [OPTION] [FILE]...
tr: Kullaným: %s [SEÇENEK] [DOSYA]...

source: Concatenate FILE(s), or standard input, to standard output. -A, --show-all equivalent to -vET -b, --number-nonblank number nonblank output lines -e equivalent to -vE -E, --show-ends display $ at end of each line -n, --number number all output lines -s, --squeeze-blank never more than one single blank line
tr: DOSYA(larý)yý (veya standart girdiyi) standart çýktýya yazar. -A, --show-all -vET ile ayný -b, --number-nonblank boþ olmayan çýktý satýrlarýný numaralandýrýr -e -vE ile ayný -E, --show-ends her satýrýn sonuna bir $ koyar -n, --number tüm çýktý satýrlarýný numaralandýrýr -s, --squeeze-blank arka arkaya gelen boþ satýrlarý bire indirger

source: -t equivalent to -vT -T, --show-tabs display TAB characters as ^I -u (ignored) -v, --show-nonprinting use ^ and M- notation, except for LFD and TAB
tr: -t -vT ile ayný -T, --show-tabs TAB karakterlerini ^I olarak gösterir -u (yoksayýlýr) -v, --show-nonprinting LFD ve TAB hariç ^ ve M- nitelemesini kullanýr

source: With no FILE, or when FILE is -, read standard input.
tr: DOSYA verilmemiþse veya DOSYA - ise, standart girdi okunur.

source: -B, --binary use binary writes to the console device.
tr: -B, --binary konsol aygýtýna yazarken ikilik yazma kullanýr.

source: Report bugs to <bug-textutils@gnu.org>.
tr: Yazýlým hatalarýný <bug-textutils@gnu.org> adresine, çeviri hatalarýný <gnu-tr-u12a@lists.sourceforge.net> adresine gönderin.

source: cannot do ioctl on `%s'
tr: `%s'a ioctl uygulanamaz

source: standard output
tr: standart çýktý

source: %s: input file is output file
tr: %s: girdi dosyasý çýktý dosyasý ile ayný

source: %s: file too long
tr: %s: dosya fazla uzun

source: Usage: %s [FILE]... or: %s [OPTION]
tr: Kullaným: %s [DOSYA]... veya: %s [SEÇENEK]

source: Print CRC checksum and byte counts of each FILE.
tr: Her DOSYA'nýn CRC saðlama toplamlarýný ve bayt sayýlarýný yazdýrýr.

source: Richard Stallman and David MacKenzie
tr: Richard Stallman ve David MacKenzie

source: Usage: %s [OPTION]... LEFT_FILE RIGHT_FILE
tr: Kullaným: %s [SEÇENEK]...SOL-DOSYA SAÐ-DOSYA

source: Compare sorted files LEFT_FILE and RIGHT_FILE line by line. -1 suppress lines unique to left file -2 suppress lines unique to right file -3 suppress lines that appear in both files
tr: Sýralanmýþ SOL-DOSYA ve SAÐ-DOSYA'yý okur ve üç kolondan oluþan bir çýktý oluþturur. Ýlk kolon sadece SOL-DOSYA'da olan satýrlarý, ikinci kolon sadece SAÐ-DOSYA'da olan satýrlarý ve üçüncü kolon da her ikisinde olan satýrlarý listeler -1 ilk kolonu yazmaz -2 ikinci kolonu yazmaz -3 üçüncü kolonu yazmaz

source: Stuart Kemp and David MacKenzie
tr: Stuart Kemp ve David MacKenzie

source: read error
tr: okuma hatasý

source: input disappeared
tr: girdi yok oldu

source: %s: line number out of range
tr: %s: satýr sayýsý kapsam dýþý

source: %s: `%s': line number out of range
tr: %s: `%s': satýr sayýsý kapsam dýþý

source: on repetition %d
tr: %d. tekrarda

source: %s: `%s': match not found
tr: %s: `%s': eþleþme bulunamadý

source: error in regular expression search
tr: düzenli ifade (regular expression) aramasýnda hata oluþtu

source: write error for `%s'
tr: `%s' için yazým hatasý

source: %s: `+' or `-' expected after delimeter
tr: %s: ayýrýcýdan sonra `+' veya `-' olmalý

source: %s: integer expected after `%c'
tr: %s: `%c' den sonra tamsayý olmalý

source: %s: `}' is required in repeat count
tr: %s: tekrar sayýmýnda `}' gerekli

source: %s}: integer required between `{' and `}'
tr: %s}: `{' ve `}' arasýna tamsayý yazýlmalý

source: %s: closing delimeter `%c' missing
tr: %s: kapatan ayýrýcý `%c' eksik

source: %s: invalid regular expression: %s
tr: %s: geçersiz düzenli ifade: %s

source: %s: invalid pattern
tr: %s: geçersiz kalýp

source: %s: line number must be greater than zero
tr: %s: satýr sayýsý 0'dan büyük olmalý

source: line number `%s' is smaller than preceding line number, %s
tr: satýr numarasý `%s' bir önceki satýr numarasý %s den daha küçük

source: warning: line number `%s' is the same as preceding line number
tr: uyarý: satýr numarasý `%s' bir önceki satýr numarasý ile ayný

source: missing conversion specifier in suffix
tr: sonekte dönüþüm belirleyicisi eksik

source: invalid conversion specifier in suffix: %c
tr: sonekte geçersiz dönüþüm belirleyicisi: %c

source: invalid conversion specifier in suffix: \%.3o
tr: sonekte geçersiz dönüþüm belirleyicisi: \%.3o

source: missing %% conversion specification in suffix
tr: sonekte %% dönüþüm belirleyicisi eksik

source: too many %% conversion specifications in suffix
tr: sonekte gereðinden fazla %% dönüþüm belirleyicisi var

source: %s: invalid number
tr: %s: geçersiz sayý

source: too few arguments
tr: argüman sayýsý yetersiz

source: Usage: %s [OPTION]... FILE PATTERN...
tr: Kullaným: %s [SEÇENEK]... DOSYA KALIP...

source: Output pieces of FILE separated by PATTERN(s) to files `xx01', `xx02', ..., and output byte counts of each piece to standard output.
tr: KALIP(lar)la ayrýlmýþ DOSYA parçalarýný `xx01', `xx02', ... isimli dosyalara, her parçanýn bayt sayýsýný standart çýktýya yazar.

source: Mandatory arguments to long options are mandatory for short options too.
tr: Uzun seçenekler için zorunlu argümanlar kýsa seçenekler için de zorunludur.

source: -b, --suffix-format=FORMAT use sprintf FORMAT instead of %d -f, --prefix=PREFIX use PREFIX instead of `xx' -k, --keep-files do not remove output files on errors
tr: -b, --suffix-format=BÝÇEM %d yerine sprintf BÝÇEM'ini kullanýr -f, --prefix=ÖNEK `xx' yerine ÖNEKi kullanýr -k, --keep-files hata olduðunda çýktý dosyalarýný silmez

source: -n, --digits=DIGITS use specified number of digits instead of 2 -s, --quiet, --silent do not print counts of output file sizes -z, --elide-empty-files remove empty output files
tr: -n, --digits=BASAMAK BASAMAK sayýsýnda basamak kullanýr (öntanýmlý 2) -s, --quiet, --silent çýktý dosyalarýnýn bayt büyüklüklerini vermez -z, --elide-empty-files boþ çýktý dosyalarýný siler

source: Read standard input if FILE is -. Each PATTERN may be:
tr: Eðer DOSYA - olarak verilmiþse, standart girdiyi okur. Her KALIP, aþaðýdaki seçeneklerden olabilir:

source: INTEGER copy up to but not including specified line number /REGEXP/[OFFSET] copy up to but not including a matching line %REGEXP%[OFFSET] skip to, but not including a matching line {INTEGER} repeat the previous pattern specified number of times {*} repeat the previous pattern as many times as possible A line OFFSET is a required `+' or `-' followed by a positive integer.
tr: SAYI verilen SAYI satýrýna kadar (SAYI satýrý hariç) kopyalar /DÜZÝF/[GÖRELÝ] kalýba uyan satýra kadar (uyan satýr hariç) kopyalar (DÜZÝF = düzenli ifade(regular expression)) %DÜZÝF%[GÖRELÝ] uyan satýra kadar (uyan satýr hariç) atlar {SAYI} bir önceki kalýbý SAYI kere tekrar eder {*} bir önceki kalýbý mümkün olduðu kadar tekrar eder Bir satýr GÖRELÝ konumu, `+' veya `-' ve ardýndan bir pozitif sayýdan oluþur.

source: David Ihnat, David MacKenzie, and Jim Meyering
tr: David Ihnat, David MacKenzie ve Jim Meyering

source: Usage: %s [OPTION]... [FILE]...
tr: Kullaným: %s [SEÇENEK]... [DOSYA]...

source: Print selected parts of lines from each FILE to standard output.
tr: Her DOSYA'daki satýrlarýn seçilen bölümlerini standart çýktýya yazdýrýr.

source: -b, --bytes=LIST output only these bytes -c, --characters=LIST output only these characters -d, --delimiter=DELIM use DELIM instead of TAB for field delimiter
tr: -b, --bytes=LÝSTE sadece bu baytlarý gösterir -c, --characters=LÝSTE sadece bu karakterleri gösterir -d, --delimiter=AYRAÇ Alan ayracý olarak TAB yerine AYRAÇ'ý kullanýr

source: -f, --fields=LIST output only these fields; also print any line that contains no delimiter character, unless the -s option is specified -n (ignored)
tr: -f, --fields=LÝSTE sadece bu alanlarý gösterir; ayrýca, eðer -s seçeneði belirtilmemiþse, içinde ayraç olmayan tüm satýrlarý yazdýrýr. -n (yoksayýlýr)

source: -s, --only-delimited do not print lines not containing delimiters --output-delimiter=STRING use STRING as the output delimiter the default is to use the input delimiter
tr: -s, --only-delimited içinde ayraç olmayan alanlarý yazdýrmaz --output-delimeter=DÝZGE çýktý ayracý olarak DÝZGE'yi kullanýr

source: Use one, and only one of -b, -c or -f. Each LIST is made up of one range, or many ranges separated by commas. Each range is one of: N N'th byte, character or field, counted from 1 N- from N'th byte, character or field, to end of line N-M from N'th to M'th (included) byte, character or field -M from first to M'th (included) byte, character or field With no FILE, or when FILE is -, read standard input.
tr: -f -b ve -c den yalnýz biri kullanýlabilir. Her LÝSTE bir aralýk, veya virgüllerle ayrýlmýþ birden fazla aralýktan oluþmalýdýr. Her aralýk aþaðýdakilerden biri olmalýdýr: N birden baþlanarak sayýldýðýnda N. bayt, karakter veya alan N- N. bayt, karakter, veya alandan satýrýn sonuna kadar N-M N ile M (dahil) arasýnda olan bayt, karakter veya alanlar -M 1 ile M (dahil) arasýnda olan bayt, karakter veya alanlar DOSYA belirtilmediðinde veya - olarak verildiðinde standart girdiden okur.

source: invalid byte or field list
tr: geçersiz bayt veya alan listesi

source: only one type of list may be specified
tr: sadece bir liste türü belirtilebilir

source: missing list of positions
tr: konum listesi eksik

source: missing list of fields
tr: alan listesi eksik

source: the delimiter must be a single character
tr: ayýrýcý tek karakter olmalýdýr

source: you must specify a list of bytes, characters, or fields
tr: bayt, karakter ya da alan listesi belirtilmelidir

source: a delimiter may be specified only when operating on fields
tr: sadece alanlar üzerinde iþlem yaparken bir ayýrýcý belirtilebilir

source: suppressing non-delimited lines makes sense only when operating on fields
tr: ayrýlmamýþ alanlarý atlamak sadece alanlar üzerinde iþlem yapýlýrken anlamlý

source: Convert tabs in each FILE to spaces, writing to standard output. With no FILE, or when FILE is -, read standard input.
tr: Her DOSYA'daki tablarý boþluða çevirerek standart çýktýya yazdýrýr. DOSYA belirtilmediðinde, veya - olduðunda, standart girdiden okur.

source: -i, --initial do not convert TABs after non whitespace -t, --tabs=NUMBER have tabs NUMBER characters apart, not 8
tr: -i, --initial Boþluktan sonra gelmeyen tablarý deðiþtýrmez -t, --tabs=N tablarýn yerine 8 deðil N boþluk koyar

source: -t, --tabs=LIST use comma separated list of explicit tab positions
tr: -t, --tabs=LÝSTE LÝSTE virgülle ayrýlmýþ sayýlardýr. Listedeki sayýlar tablarýn satýrdaki yerlerine karþýlýk gelir. Satýrda listenin uzunluðundan fazla tab varsa, fazla olan tablar yerine bir boþluk koyar

source: tab size contains an invalid character
tr: tab boyunda geçersiz karakter

source: tab size cannot be 0
tr: tab boyu 0 olamaz

source: tab sizes must be ascending
tr: tab boylarý küçükten büyüðe sýralý olmalý

source: Usage: %s [-DIGITS] [OPTION]... [FILE]...
tr: Kullaným: %s [-BASAMAKLAR] [SEÇENEK]... [DOSYA]...

source: Reformat each paragraph in the FILE(s), writing to standard output. If no FILE or if FILE is `-', read standard input.
tr: DOSYA(lar)daki tüm paragraflarý yeniden biçemlendirir ve standart çýktýya yazar. Eðer DOSYA adý yoksa veya `-' ise, standart girdiden okur.

source: -c, --crown-margin preserve indentation of first two lines -p, --prefix=STRING combine only lines having STRING as prefix -s, --split-only split long lines, but do not refill
tr: -c, --crown-margin paragrafýn ilk iki satýrý deðiþtirmez, ikinci satýrdan sonraki satýrlarý ikinci satýrla hizalar -p, --prefix=DÝZGE sadece DÝZGE ile baþlayan satýrlarý birleþtirir -s, --split-only uzun satýrlarý böler fakat kýsalarý birleþtirmez

source: -t, --tagged-paragraph indentation of first line different from second -u, --uniform-spacing one space between words, two after sentences -w, --width=NUMBER maximum line width (default of 75 columns)
tr: -t, --tagged-paragraph -c ile ayný, ancak paragrafýn ilk iki satýrý ayný hizadaysa ilk satýrý tek satýrlýk paragraf olarak kabul eder. -u, --uniform-spacing sözcük arasý bir, noktadan sonra iki boþluk koyar. -w, --width=N maksimum satýr geniþliði (bu seçenek kullanýlmadýðýnda satýr geniþliði 72 dir)

source: In -wNUMBER, the letter `w' may be omitted.
tr: -wSAYI seçeneðinde, `w' harfi yazýlmayabilir.

source: invalid width option: `%s'
tr: geçersiz geniþlik seçeneði: `%s'

source: invalid width: `%s'
tr: geçersiz geniþlik: `%s'

source: Wrap input lines in each FILE (standard input by default), writing to standard output.
tr: DOSYA'daki (DOSYA belirtilmediðinde standart girdi'deki) satýrlarý katlar ve standart çýktýya yazar

source: -b, --bytes count bytes rather than columns -s, --spaces break at spaces -w, --width=WIDTH use WIDTH columns instead of 80
tr: -b, --bytes sütunlar yerine baytlarý sayar -s, --spaces satýrý boþluklarda böler -w, --width=N 80 yerine N sütun kullanýr

source: invalid number of columns: `%s'
tr: geçersiz sütun sayýsý: `%s'

source: Print first 10 lines of each FILE to standard output. With more than one FILE, precede each with a header giving the file name. With no FILE, or when FILE is -, read standard input.
tr: Her DOSYA'nýn ilk on satýrýný standart çýktýya yazdýrýr. Birden fazla DOSYA verildiðinde, her dosyadan önce dosya adýný yazdýrýr. DOSYA adý verilmediðinde, veya - olduðunda standart girdiden okur.

source: -c, --bytes=SIZE print first SIZE bytes -n, --lines=NUMBER print first NUMBER lines instead of first 10
tr: -c, --bytes=SAYI ilk SAYI baytý gösterir -n, --lines=N ilk 10 yerine ilk N satýrý gösterir

source: -q, --quiet, --silent never print headers giving file names -v, --verbose always print headers giving file names
tr: -q, --quiet, --silent dosya isimlerini göstermez -v, --verbose dosya isimlerini daima gösterir

source: SIZE may have a multiplier suffix: b for 512, k for 1K, m for 1 Meg.
tr: SAYI, bir katsayý soneki içerebilir: 512 için b, 1K için k, 1 Meg için m.

source: standard input
tr: standart girdi

source: %s: %s is so large that it is not representable
tr: %s: %s bu bilgisayarda kullanýlamayacak kadar büyük bir sayý

source: number of lines
tr: satýr sayýsý

source: number of bytes
tr: bayt sayýsý

source: invalid number of lines
tr: geçersiz satýr sayýsý

source: invalid number of bytes
tr: geçersiz bayt sayýsý

source: unrecognized option `-%c'
tr: bilinmeyen seçenek `-%c'

source: Usage: %s [OPTION]... FILE1 FILE2
tr: Kullaným: %s [SEÇENEK]... DOSYA1 DOSYA2

source: For each pair of input lines with identical join fields, write a line to standard output. The default join field is the first, delimited by whitespace. When FILE1 or FILE2 (not both) is -, read standard input. -a SIDE print unpairable lines coming from file SIDE -e EMPTY replace missing input fields with EMPTY
tr: Her birleþtýrme (join) alaný ayný olan girdi satýrý çifti için standart çýktýya bir satýr yazar. Öntanýmlý birleþtýrme alaný, boþlukla ayrýlmýþ ilk alandýr. DOSYA1 veya DOSYA2 - olduðunda (ikisi birden - olamaz), standart girdiden okur. -a YAN YAN dosyasýndan gelen eþleþtirilememiþ satýrlarý yazdýrýr -e YAZI eksik girdi alanlarýný YAZI ile deðiþtirir

source: -i, --ignore-case ignore differences in case when comparing fields -j FIELD (obsolescent) equivalent to `-1 FIELD -2 FIELD' -j1 FIELD (obsolescent) equivalent to `-1 FIELD' -j2 FIELD (obsolescent) equivalent to `-2 FIELD' -o FORMAT obey FORMAT while constructing output line -t CHAR use CHAR as input and output field separator
tr: -i, --ignore-case karþýlaþtýrma yaparken küçük/büyük harf ayrýmý yapmaz -j ALAN (eski kullaným)`-1 ALAN -2 ALAN' ile ayný -j1 ALAN (eski kullaným)`-1 ALAN' ile ayný -j2 ALAN (eski kullaným)`-2 ALAN' ile ayný -o BÝÇEM çýktý satýrýný oluþtururken BÝÇEM'i kullanýr -t HARF HARFi girdi ve çýktý alanlarýný ayýrmakta kullanýr

source: -v SIDE like -a SIDE, but suppress joined output lines -1 FIELD join on this FIELD of file 1 -2 FIELD join on this FIELD of file 2
tr: -v YAN -a YAN gibi, fakat birleþtirilmiþ satýrlarý göstermez -1 ALAN DOSYA1'in bu ALAN'ýný kullanarak birleþtirir -2 ALAN DOSYA2'nin bu ALAN'ýný kullanarak birleþtirir

source: Unless -t CHAR is given, leading blanks separate fields and are ignored, else fields are separated by CHAR. Any FIELD is a field number counted from 1. FORMAT is one or more comma or blank separated specifications, each being `SIDE.FIELD' or `0'. Default FORMAT outputs the join field, the remaining fields from FILE1, the remaining fields from FILE2, all separated by CHAR.
tr: Eðer -t HARF verilmemiþ ise, baþlangýçtaki boþluklar alan ayracýdýr ve yoksayýlýrlar. Eðer -t HARF verilmiþ ise, ayraç olarak HARF kullanýlýr. ALAN, 1'den baþlayarak sayýlan alan numarasýdýr. BÝÇEM, bir veya daha fazla, virgül veya boþlukla ayrýlmýþ biçemdir. Biçem, `YAN.ALAN' veya `0' olarak verilir. Öntanýmlý BÝÇEM, HARF ile ayrýlmýþ olarak, birleþtýrme alanýný, DOSYA1'de kalan alanlarý ve DOSYA2'de kalan alanlarý gösterir.

source: invalid field specifier: `%s'
tr: geçersiz alan belirleyicisi: `%s'

source: invalid field number: `%s'
tr: geçersiz alan numarasý: `%s'

source: invalid file number in field spec: `%s'
tr: alan tanýmlamasýnda geçersiz dosya numarasý: `%s'

source: invalid field number for file 1: `%s'
tr: dosya 1 icin geçersiz alan numarasý : `%s'

source: invalid field number for file 2: `%s'
tr: dosya 2 için geçersiz alan numarasý: `%s'

source: too many non-option arguments
tr: çok sayýda `seçenek olmayan' argüman var

source: too few non-option arguments
tr: çok az `seçenek olmayan' argüman

source: both files cannot be standard input
tr: her iki dosya da standart girdi olamaz

source: Ulrich Drepper and Scott Miller
tr: Ulrich Drepper ve Scott Miller

source: Usage: %s [OPTION] [FILE]... or: %s [OPTION] --check [FILE] Print or check %s (%d-bit) checksums. With no FILE, or when FILE is -, read standard input.
tr: Kullaným: %s [SECENEK] [DOSYA]... veya: %s [SECENEK] --check [DOSYA] %s (%d-bit) saðlama toplamlarýný kontrol eder veya yazar. DOSYA adý verilmediðinde veya - olduðunda standart girdiden okur.

source: -b, --binary read files in binary mode (default on DOS/Windows) -c, --check check %s sums against given list -t, --text read files in text mode (default)
tr: -b, --binary dosyalarý ikilik kipinde okur (DOS/Windows üzerinde varsayýlan) -c, --check %s toplamlarýný verilen liste ile karþýlaþtýrýr -t, --text dosyalarý metin kipinde okur (varsayýlan)

source: The following two options are useful only when verifying checksums: --status don't output anything, status code shows success -w, --warn warn about improperly formated checksum lines
tr: Aþaðýdaki iki seçenek sadece saðlama toplamlarýný kontrol ederken iþe yarar: --status çýktý vermez, durum kodu, baþarý bilgisini verir -w, --warn yanlýþ biçemlenmiþ saðlama toplam satýrlarý hakkýnda uyarý verir

source: The sums are computed as described in %s. When checking, the input should be a former output of this program. The default mode is to print a line with checksum, a character indicating type (`*' for binary, ` ' for text), and name for each FILE.
tr: Toplamlar %s'de belirtildiði gibi hesaplanýr. Toplamlar kontrol edilirken, girdi, bu yazýlýmdan önceden elde edilmiþ bir çýktý olmalýdýr. Öntanýmlý olarak, her satýrý bir saðlama toplamý ile yazdýrýr, tür belirtir (ikilik için `*' , metin için ` ') ve DOSYA'nýn ismini yazar.

source: %s: %lu: improperly formatted %s checksum line
tr: %s: %lu: %s saðlama toplam satýrý yanlýþ biçemlenmiþ

source: %s: FAILED open or read
tr: %s:açma veya okuma BAÞARISIZ

source: FAILED
tr: BAÞARISIZ

source: OK
tr: Tamam

source: %s: read error
tr: %s: okuma hatasý

source: %s: no properly formatted %s checksum lines found
tr: %s: doðru biçemlenmiþ %s saðlama toplam satýrý bulunamadý

source: WARNING: %d of %d listed %s could not be read
tr: UYARI: Listelenmiþ %2$d adet %3$s içinden %1$d'si okunamadý

source: file
tr: dosya

source: files
tr: dosyalar

source: WARNING: %d of %d computed %s did NOT match
tr: UYARI: Hesaplanmýþ %2$d adet %3$s içinden %1$d'si eþleþmedi

source: checksum
tr: saðlama toplamý

source: checksums
tr: saðlama toplamlarý

source: the --binary and --text options are meaningless when verifying checksums
tr: --binary ve --text seçenekleri saðlama toplamlarýný kontrol ederken geçersiz

source: the --string and --check options are mutually exclusive
tr: --string ve --check seçenekleri ayný anda kullanýlamaz

source: the --status option is meaningful only when verifying checksums
tr: --status seçeneði yalnýzca saðlama toplam kontrolü sýrasýnda kullanýlmalý

source: the --warn option is meaningful only when verifying checksums
tr: --warn seçeneði yalnýzca saðlama toplam kontrolü sýrasýnda kullanýlmalý

source: no files may be specified when using --string
tr: --string seçeneði kullanýlýrken dosya adý belirtilemez
