Repository: bragin/syllable
Catalog: system/apps/gnu/textutils-2.0.21/po/*.po
Languages: tr

source: only one argument may be specified when using --check
tr: --check seçeneði kullanýlýrken sadece bir dosya adý verilebilir

source: Scott Bartram and David MacKenzie
tr: Scott Bartram ve David MacKenzie

source: Write each FILE to standard output, with line numbers added. With no FILE, or when FILE is -, read standard input.
tr: Satýr baþlarýna satýr numarasý koyarak her DOSYA'yý standart çýktýya yazdýrýr. DOSYA adý verilmemiþse, veya - olarak verilmiþse, standart girdiden okur.

source: -b, --body-numbering=STYLE use STYLE for numbering body lines -d, --section-delimiter=CC use CC for separating logical pages -f, --footer-numbering=STYLE use STYLE for numbering footer lines
tr: -b, --body-numbering=TARZ satýrlarý TARZ tarzýnda numaralandýrýr. -d, --section-delimiter=KK mantýksal sayfalarý ayýrýrken KK'yi kullanýr -f, --footer-numbering=TARZ altyazýlarý TARZ tarzýnda numaralandýrýr

source: -h, --header-numbering=STYLE use STYLE for numbering header lines -i, --page-increment=NUMBER line number increment at each line -l, --join-blank-lines=NUMBER group of NUMBER empty lines counted as one -n, --number-format=FORMAT insert line numbers according to FORMAT -p, --no-renumber do not reset line numbers at logical pages -s, --number-separator=STRING add STRING after (possible) line number
tr: -h, --header-numbering=TARZ üstyazýlarý TARZ tarzýnda numaralandýrýr -i, --page-increment=SAYI satýr numarasý artýþ miktarý -l, --join-blank-lines=SAYI SAYI kadar boþ satýr grubunu bir satýr olarak okur -n, --number-format=BÝÇEM satýr numaralarýný BÝÇEM olarak biçemler -p, --no-renumber yeni mantýksal sayfaya baþladýðýnda satýr numaralarýný baþtan baþlatmaz -s, --number-separator=DÝZGE satýr numarasýndan sonra DÝZGE yazdýrýr

source: -v, --first-page=NUMBER first line number on each logical page -w, --number-width=NUMBER use NUMBER columns for line numbers
tr: -v, --first-page=SAYI her mantýksal sayfanýn ilk satýr numarasý -w, --number-width=SAYI satýr numarasý geniþliðini SAYI yapar

source: By default, selects -v1 -i1 -l1 -sTAB -w6 -nrn -hn -bt -fn. CC are two delimiter characters for separating logical pages, a missing second character implies :. Type \\ for \. STYLE is one of:
tr: Varsayýlan deðerler: -v1 -i1 -l1 -sTAB -w6 -nrn -hn -bt -fn KK, mantýksal sayfalarý ayýrmak için kullanýlan iki ayraç karakteridir. Ýkinci karakter verilmemiþse :. varsayýlýr. \. elde etmek için \\ yazýlýr. TARZ, aþaðýdaki deðerlerden biri olarak belirtilmelidir:

source: a number all lines t number only nonempty lines n number no lines pREGEXP number only lines that contain a match for REGEXP FORMAT is one of: ln left justified, no leading zeros rn right justified, no leading zeros rz right justified, leading zeros
tr: a bütün satýrlarý numaralandýrýr t sadece boþ olmayan satýrlarý numaralandýrýr n hiç bir satýrý numaralandýrmaz pDÜZÝF sadece DÜZÝF düzenli ifadesi ile eþleþen satýrlarý numaralandýrýr (DÜZÝF: düzenli ifade = regular expression) BÝÇEM aþaðýdakilerden biri olabilir: ln sola dayalý yazdýrýr, numaralarýn baþlarýna sýfýr koymaz rn saða dayalý yazdýrýr, numaralarýn baþlarýna sýfýr koymaz rz saða dayalý yazdýrýr, numaralarýn baþlarýna sýfýr koyar

source: invalid starting line number: `%s'
tr: geçersiz baþlangýç satýr numarasý: `%s'

source: invalid line number increment: `%s'
tr: geçersiz satýr numarasý artýþý: `%s'

source: invalid number of blank lines: `%s'
tr: geçersiz boþ satýr sayýsý: `%s'

source: invalid line number field width: `%s'
tr: geçersiz satýr numarasý alan geniþliði: `%s'

source: Usage: %s [OPTION]... [FILE]... or: %s --traditional [FILE] [[+]OFFSET [[+]LABEL]]
tr: Kullaným: %s [SEÇENEK]... [DOSYA]... veya: %s --traditional [DOSYA] [[+]GÖRELÝ [[+]ETÝKET]]

source: Write an unambiguous representation, octal bytes by default, of FILE to standard output. With more than one FILE argument, concatenate them in the listed order to form the input. With no FILE, or when FILE is -, read standard input.
tr: DOSYA'yý, (hiçbir seçenek belirtilmediðinde sekizlik biçeminde), standart çýktýya yazar. DOSYA adý verilmemiþse veya - olarak verilmiþse, standart girdiden okur.

source: -A, --address-radix=RADIX decide how file offsets are printed -j, --skip-bytes=BYTES skip BYTES input bytes first
tr: -A, --address-radix=RADIX adresleri RADIX sayý sisteminde yazar -j, --skip-bytes=BAYT her dosyanýn ilk BAYT baytýný atlar

source: -f same as -t fF, select floats -h same as -t x2, select hexadecimal shorts -i same as -t d2, select decimal shorts -l same as -t d4, select decimal longs -o same as -t o2, select octal shorts -x same as -t x2, select hexadecimal shorts
tr: -f veya -t fF, gerçel sayýlarý seçer -h veya -t x2, 16lik kýsa sayýlarý seçer -i veya -t d2, 10luk kýsa sayýlarý seçer -l veya -t d4, 10luk uzun sayýlarý seçer -o veya -t o2, 8lik kýsa sayýlarý seçer -x veya -t x2, 16lik kýsa sayýlarý seçer

source: d[SIZE] signed decimal, SIZE bytes per integer f[SIZE] floating point, SIZE bytes per integer o[SIZE] octal, SIZE bytes per integer u[SIZE] unsigned decimal, SIZE bytes per integer x[SIZE] hexadecimal, SIZE bytes per integer
tr: d[SAYI] iþaretli (signed) ondalýk sayý olarak yazar, her sayý için SAYI bayt kullanýr f[SAYI] gerçel sayý olarak yazar, her sayý için SAYI bayt kullanýr o[SAYI] sekizlik sayý olarak yazar, her sayý için SAYI bayt kullanýr u[SAYI] iþaretsiz (unsigned) ondalýk sayý olarak yazar, her sayý için SAYI bayt kullanýr x[SAYI] 16lik sayý olarak yazar, her sayý için SAYI bayt kullanýr

source: SIZE is a number. For TYPE in doux, SIZE may also be C for sizeof(char), S for sizeof(short), I for sizeof(int) or L for sizeof(long). If TYPE is f, SIZE may also be F for sizeof(float), D for sizeof(double) or L for sizeof(long double).
tr: SAYI yerine genelde bir sayý yazýlýr ( örnek : od -t d1 ), ancak SEKIL d,o,u,x den biri olduðunda SAYI yerine sizeof(char) anlamýna gelen C, sizeof(short) anlamýna gelen S veya sizeof(long) anlamana gelen L de gelebilir. Eðer SEKIL f ise, SAYI yerine sizeof(float) anlamýna gelen F, sizeof(double) anlamýna gelen D veya sizeof(long double) anlamýna gelen L de gelebilir.

source: RADIX is d for decimal, o for octal, x for hexadecimal or n for none. BYTES is hexadecimal with 0x or 0X prefix, it is multiplied by 512 with b suffix, by 1024 with k and by 1048576 with m. Adding a z suffix to any type adds a display of printable characters to the end of each line of output.
tr: RADIX yerine sayý sistemini belirtmek için bir harf yazýlýr: onluk sistem için d, sekizlik sistem için o, 16lik sistem için x ve hiçbiri için n. BAYT'ýn baþýna 0x veya 0X koyarak bu sayýnýn 16lik sistemde olduðunu belirtebilirsiniz. Sonuna b koyarsanýz 512 ile, k koyarsanýz 1024 ile, m koyarsanýz 1048576 ile çarpýlmasýný istediðinizi belirtmis olursunuz. Herhangi bir þekilin sonuna ( þekiller: a,c,d,f,o,u,x) z eklerseniz od her satýrýn sonuna o satýrdaki tüm okunabilir karakterleri yazar.

source: invalid type string `%s'
tr: geçersiz tür dizgesi `%s'

source: invalid type string `%s'; this system doesn't provide a %lu-byte integral type
tr: geçersiz tür dizgesi `%s'; bu sistem, yerleþik bir %lu baytlýk tamsayý türü desteklemiyor

source: invalid type string `%s'; this system doesn't provide a %lu-byte floating point type
tr: geçersiz tür dizgesi `%s'; bu sistem %lu baytlýk bir kayan ondalýk türü desteklemiyor

source: invalid character `%c' in type string `%s'
tr: tür dizgesi `%2$s' içinde geçersiz `%1$c' karakteri

source: cannot skip past end of combined input
tr: girdinin dikkate alýnmayacak bölümü toplam girdiden daha büyük verilmiþ

source: old-style offset
tr: eski tarz göreli konum

source: invalid output address radix `%c'; it must be one character from [doxn]
tr: geçersiz çýktý adres radix'i `%c'; [doxn] harflerinden biri olmalý

source: skip argument
tr: argümaný atlar

source: limit argument
tr: argümaný sýnýrlar

source: minimum string length
tr: minimum dizge uzunluðu

source: %s is too large
tr: %s çok büyük

source: width specification
tr: geniþlik tanýmý

source: no type may be specified when dumping strings
tr: dizgeler çýktýlanýrken tür belirtilemez

source: invalid second operand in compatibility mode `%s'
tr: `%s' uygunluk kipinde geçersiz ikinci iþlenen

source: in compatibility mode, the last two arguments must be offsets
tr: eski kullanýmda son iki argüman göreli konum olmalý

source: compatibility mode supports at most three arguments
tr: eski kullanýmda en fazla üç argüman kullanýlabilir

source: warning: invalid width %lu; using %d instead
tr: uyarý: geçersiz geniþlik %lu; %d kullanýlýyor

source: %d: fmt="%s" width=%d
tr: %d: bçm="%s" geniþlik=%d

source: David M. Ihnat and David MacKenzie
tr: David M. Ihnat ve David MacKenzie

source: standard input is closed
tr: standart girdi kapalý

source: Write lines consisting of the sequentially corresponding lines from each FILE, separated by TABs, to standard output. With no FILE, or when FILE is -, read standard input.
tr: Standart çýktýya her DOSYAdan ayný sýrada olan satýrlarý aralarýna tablar koyarak yazar. DOSYA adý verilmediðinde veya - olduðunda standart girdiden okur

source: -d, --delimiters=LIST reuse characters from LIST instead of TABs -s, --serial paste one file at a time instead of in parallel
tr: -d, --delimiters=LISTE TABlar yerine LISTE'deki karakterleri kullanýr -s, --serial Her dosyayý (paralel olarak yazmak yerine) arka arkaya yazar

source: Pete TerMaat and Roland Huebner
tr: Pete TerMaat ve Roland Huebner

source: `--pages' invalid range of page numbers: `%s'
tr: `--pages' geçersiz sayfa numara aralýðý: `%s'

source: `--pages' invalid starting page number: `%s'
tr: `--pages' geçersiz baþlangýç sayfa numarasý: `%s'

source: `--pages' invalid ending page number: `%s'
tr: `--pages' geçersiz son sayfa numarasý: `%s'

source: `--pages' starting page number is larger than ending page number
tr: `--pages' baþlangýç sayfa numarasý son sayfa numarasýndan daha büyük

source: `--pages=FIRST_PAGE[:LAST_PAGE]' missing argument
tr: `--pages=ÝLK_SAYFA[:SON_SAYFA]' argüman eksik

source: `--columns=COLUMN' invalid number of columns: `%s'
tr: `--columns=SÜTUN' geçersiz sütun sayýsý: `%s'

source: `-l PAGE_LENGTH' invalid number of lines: `%s'
tr: `-l SAYFA_UZUNLUÐU' geçersiz satýr sayýsý: `%s'

source: `-N NUMBER' invalid starting line number: `%s'
tr: `-N SAYI' geçersiz baþlangýç satýr numarasý: `%s'

source: `-o MARGIN' invalid line offset: `%s'
tr: `-o KENAR' geçersiz satýr göreli konumu: `%s'

source: `-w PAGE_WIDTH' invalid number of characters: `%s'
tr: `-w SAYFA_GENÝÞLÝÐÝ' geçersiz harf sayýsý: `%s'

source: `-W PAGE_WIDTH' invalid number of characters: `%s'
tr: `-W SAYFA_GENÝÞLÝÐÝ' geçersiz harf sayýsý: `%s'

source: Cannot specify number of columns when printing in parallel.
tr: Paralel yazdýrma yapýlýrken sütun sayýsý belirtilemez.

source: Cannot specify both printing across and printing in parallel.
tr: Hem paralel yazým, hem altalta yazým yapýlamaz.

source: `-%c' extra characters or invalid number in the argument: `%s'
tr: `-%c' argüman içinde fazla harf veya geçersiz sayý: `%s'

source: page width too narrow
tr: sayfa geniþliði çok dar

source: starting page number larger than total number of pages: `%d'
tr: baþlangýç sayfa sayýsý toplam sayfa sayýsýndan daha büyük: `%d'

source: Page %d
tr: Sayfa %d

source: Paginate or columnate FILE(s) for printing.
tr: DOSYA(larý)yý kolonlara ayýrýr veya sayfalandýrýr ve yazar .

source: +FIRST_PAGE[:LAST_PAGE], --pages=FIRST_PAGE[:LAST_PAGE] begin [stop] printing with page FIRST_[LAST_]PAGE -COLUMN, --columns=COLUMN produce COLUMN-column output and print columns down, unless -a is used. Balance number of lines in the columns on each page.
tr: +ILK_SAYFA[:SON_SAYFA], --pages=ILK_SAYFA[:SON_SAYFA] yazmaya ILK_SAYFA'dan baþlar (SON_SAYFA belirtilmiþse SON_SAYFA'da durur) -KOLON, -columns=KOLON yazýyý KOLON kolona ayýrýr , ve -a seçeneði verilmemiþse kolonlarý yukardan aþaðý yazar. Her sayfada tüm kolonlarýn satýr sayýlarýný ayný yapar

source: -a, --across print columns across rather than down, used together with -COLUMN -c, --show-control-chars use hat notation (^G) and octal backslash notation -d, --double-space double space the output
tr: -a, --across satýrlarý yukardan aþaðý yerine soldan saða yazar. bu seçenek -KOLON ile kullanýlýr -c, --show-control-chars þapka(^G) ve sekizli ters kesik notasyonunu kullanarak kontrol karakterlerini de gösterir -d, --double-space çift aralýk býrakarak yazar

source: -D, --date-format=FORMAT use FORMAT for the header date -e[CHAR[WIDTH]], --expand-tabs[=CHAR[WIDTH]] expand input CHARs (TABs) to tab WIDTH (8) -F, -f, --form-feed use form feeds instead of newlines to separate pages (by a 3-line page header with -F or a 5-line header and trailer without -F)
tr: -D, --date-format=FORMAT baþlýk tarihini yazarken FORMAT'ý kullanýr -e[KARAKTER[GENISLIK]], --expand-tabs[=KARAKTER[GENISLIK]] KARAKTER(KARAKTER belirtilmediðinde TAB) yerine GENISLIK(GENISLIK belirtilmediðinde 8) tane boþluk koyar -F, -f, --form-feed yenisatýr karakteri yerine (\n) formfeed (\f) karakteri kullanarak sayfalarý ayýr

source: -l PAGE_LENGTH, --length=PAGE_LENGTH set the page length to PAGE_LENGTH (66) lines (default number of lines of text 56, and with -F 63) -m, --merge print all files in parallel, one in each column, truncate lines, but join lines of full length with -J
tr: -l SAYFA_UZUNLUGU, --length=SAYFA_UZUNLUGU sayfa uzunluðunu SAYFA_UZUNLUGU yapar. Bu seçenek kullanýl- madýkca sayfa uzunluðu 56 satýrdýr. -F seçeneði kullanýl- dýðýnda sayfa uzunluðu 63 tür. -m, --merge tüm dosyalarý yan yana yazar, her biri bir kolona, çok uzun satýrlarý keser, ve yan yana gelen kolonlar tam bir satýr oluþturuyorlarsa, onlarý da büyük tek bir kolonda toplar ( -J deki gibi)

source: -n[SEP[DIGITS]], --number-lines[=SEP[DIGITS]] number lines, use DIGITS (5) digits, then SEP (TAB), default counting starts with 1st line of input file -N NUMBER, --first-line-number=NUMBER start counting with NUMBER at 1st line of first page printed (see +FIRST_PAGE)
tr: -n[AYIR[SAY]], --number-lines[=AYIR[SAY]] satýrlarý SAY basamak kullanarak numaralandýrýr ve satýr numarasýný satýrdan AYIR ile ayýrýr. (AYIR belirtilmediðinde TAB kullanýr, SAY belirtilmediðinde 5 kullanýr) -N SAYI, --first-line-number=SAYI satýr numaralandýrmaya SAYI'dan baþlar(örnek: pr -N 5 ilk satýra 5 , ikinci satýra 6,... numaralarýný verir) (+ILK_SAYFA seçeneðine de bakýnýz)

source: -o MARGIN, --indent=MARGIN offset each line with MARGIN (zero) spaces, do not affect -w or -W, MARGIN will be added to PAGE_WIDTH -r, --no-file-warnings omit warning when a file cannot be opened
tr: -o KENAR, --indent=KENAR her sayfanýn baþýnda KENAR boþluk býrakýr. Bu seçenek -w veya -W yu etkilemez, býrakýlan boþluk SAYFA_GENISLIGI'ne eklenir -r, --no-file-warnings belirtilen dosyayý açamadýðýnda hata mesajý vermez

source: -s[CHAR],--separator[=CHAR] separate columns by a single character, default for CHAR is the <TAB> character without -w and 'no char' with -w -s[CHAR] turns off line truncation of all 3 column options (-COLUMN|-a -COLUMN|-m) except -w is set
tr: -s[KAR], --seperator[=KAR] kolonlarý tek bir karakterle (KAR) ayýr, bu seçenek kullanýlmadýðýnda kolonlar TAB ile ayrýlýr. Bu seçenek diðer hiçbir seçeneðin satýrlarý kýsaltmasýna izin vermez

source: -T, --omit-pagination omit page headers and trailers, eliminate any pagination by form feeds set in input files -v, --show-nonprinting use octal backslash notation -w PAGE_WIDTH, --width=PAGE_WIDTH set page width to PAGE_WIDTH (72) characters for multiple text-column output only, -s[char] turns off (72)
tr: -T, --omit-pagination dosyalarý sayfalandýrmaz, baþlýk ve bitiþ koymaz -v, --show-nonprinting sekizli terskesik notasyonunu kullanarak ekranda normalde gözükmeyecek karakterleri de yazar -w SAYFA_GENISLIGI, --width=SAYFA_GENISLIGI sayfa geniþliðini birden fazla kolon olan çýktýlarý için SAYFA_GENISLIGI yapar. Sayfa geniþliði -w kullanýl- madýðýnda 72 dir. -s[KAR] seçeneði kullanýldýðýnda sayfa geniþliði otomatik olarak 72 olmaz. Hem -s seçeneðini kullanmak hem de sayfa geniþliðinin ayarlý olmasýný istiyor- sanýz -w seçeneðini mutlaka kullanýn

source: -W PAGE_WIDTH, --page-width=PAGE_WIDTH set page width to PAGE_WIDTH (72) characters always, truncate lines, except -J option is set, no interference with -S or -s
tr: -W SAYFA_GENISLIGI, --page-width=SAYFA_GENISLIGI sayfa geniþliðini her çeþit çýktý için SAYFA_GENISLIGI yapar( -W kullanýlmadýðýnda sayfa geniþliði 72'dir ). -J seçeneði belirtilmedikçe uzun satýrlarý keser. Bu seçenek ve -s ,-S seçenekleri birbirlerini etkilemezler

source: -T implied by -l nn when nn <= 10 or <= 3 with -F. With no FILE, or when FILE is -, read standard input.
tr: pr -l nn seçeneði nn 11 den küçükse -T seçeneði de verilmiþ gibi kabul eder nn üçten küçükse ve -F de verilmiþse -T gene verilmiþ kabul edilir. DOSYA belirtilmediðinde veya - olduðunda standart girdiden okur

source: %s (for regexp `%s')
tr: %s (`%s' düzenli ifadesi için)

source: Usage: %s [OPTION]... [INPUT]... (without -G) or: %s -G [OPTION]... [INPUT [OUTPUT]]
tr: Kullaným: %s [SEÇENEK]... [GÝRDÝ]... (-G olmaksýzýn) veya: %s -G [SEÇENEK]... [GÝRDÝ [ÇIKTI]]

source: Output a permuted index, including context, of the words in the input files.
tr: girdi dosyasýndaki kelimelerin (contextleriyle beraber),bir permutasyonunu oluþturur.

source: -A, --auto-reference output automatically generated references -C, --copyright display Copyright and copying conditions -G, --traditional behave more like System V `ptx' -F, --flag-truncation=STRING use STRING for flagging line truncations
tr: -A, --auto-reference Satýrbaþlarýna referans bilgileri koyar -C, --copyright Kopyalama hakký bilgilerine ve þartlarýný gösterir -G, --traditional System V'deki ptx gibi davranýr -F, --flag-truncation=DÝZGE Satýrlarý kesmesi gerektiðinde satýrý kestiði yeri DÝZGE ile belirtir

source: -M, --macro-name=STRING macro name to use instead of `xx' -O, --format=roff generate output as roff directives -R, --right-side-refs put references at right, not counted in -w -S, --sentence-regexp=REGEXP for end of lines or end of sentences -T, --format=tex generate output as TeX directives
tr: -M, --macro-name=DÝZGE TeX formatýnda çýktý oluþtururken `xx' yerine DÝZGE makrosunu kullanýr -O, --format=roff roff direktifleri formatýnda çýktý oluþturur -R, --right-side-refs -A seçeneðinde oluþturulan referanslarý satýrbaþýna deðil, satýrsonuna koyar( -A ile beraber kullanýmý anlamlý bir seçenek) -S, --sentence-regexp=REGEXP satýr sonlarýný REGEXP'i (REGEXP = regular expression (düzenli ifade) ) -T, --format=tex TeX formatýnda çýktý oluþtur

source: -W, --word-regexp=REGEXP use REGEXP to match each keyword -b, --break-file=FILE word break characters in this FILE -f, --ignore-case fold lower case to upper case for sorting -g, --gap-size=NUMBER gap size in columns between output fields -i, --ignore-file=FILE read ignore word list from FILE -o, --only-file=FILE read only word list from this FILE
tr: -W, --word-regexp=REGEXP anahtar kelimeleri REGEXP'i kullanarak belirler -b, --break-file=DOSYA DOSYA'daki karakterlere bakarak kelime sonlarýný belirler -f, --ignore-case büyük/küçük harf ayrýmý yapmaz -g, --gap-size=SAYI çýktýnýn kolonlarý arasýndaki boþluk geniþliði SAYI olur -i, --ignore-file=DOSYA girdi üzerinde çalýþýrken DOSYA daki kelimeleri dikkate almaz -o, --only-file=DOSYA girdide sadece DOSYA'daki kelimeleri dikkate alýr

source: -r, --references first field of each line is a reference -t, --typeset-mode - not implemented - -w, --width=NUMBER output width in columns, reference excluded
tr: -r, --references her satýrýn ilk alanýný referans olarak kullanýr -t, --typeset-mode [henüz çalýþmayan bir seçenek] -w, --width=SAYI çýktýdaki kolon sayýsý SAYI olur (referans hariç)

source: With no FILE or if FILE is -, read Standard Input. `-F /' by default.
tr: DOSYA belirtilmediðinde veya - olduðunda standart girdiden okur. `-F /' seçeneði verilmiþ gibi çalýþýr

source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2, or (at your option) any later version.
tr: Bu, bir serbest yazýlýmdýr; Free Software Foundation tarafýndan yayýnlanan GNU Genel Kamu Lisansý, 2. sürüm (veya sizin seçiminize baðlý olarak) daha üst sürüm koþullarý altýnda deðiþiklik yapabilir ve/veya yeniden daðýtabilirsiniz.

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
tr: Bu program kullanýþlý olabileceði umularak daðýtýlmaktadýr. Ancak, hiçbir GARANTÝSÝ YOKTUR; hatta SATILABÝLÝRLÝÐÝ veya HERHANGÝ BÝR AMACA UYGUNLUÐU için bile garanti verilmez. Daha ayrýntýlý bilgi edinmek için GNU Genel Kamu Lisansýna bakýnýz.

source: You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.
tr: GNU Genel Kamu Lisansýnýn bir kopyasýný bu yazýlýmla birlikte almýþ olacaksýnýz; yoksa Free Software Foundation, Inc., 59 Temple Place Suite 330, Boston, MA 02111-1307, USA. adresinden isteyebilirsiniz.

source: Mike Haertel and Paul Eggert
tr: Mike Haertel ve Paul Eggert

source: Write sorted concatenation of all FILE(s) to standard output. Ordering options:
tr: DOSYA(larýn)nýn sýralanmýþ halini standart çýktýya yazar. sort sýralama yaparken her satýrýn belli bir bölümune bakarak sýralama yapar. Baktýðý bölüme sýralama anahtarý denir. Bu anahtarý aþaðýdaki seçenekleri kullanarak belirtebilirsiniz. Seçeneklerden sonra anahtarlarýn nasýl oluþturulduðuyla ilgili bilgi bulabilirsiniz. Sýralama seçenekleri:

source: -b, --ignore-leading-blanks ignore leading blanks -d, --dictionary-order consider only blanks and alphanumeric characters -f, --ignore-case fold lower case to upper case characters
tr: -b, --ignore-leading-blanks sýralanacak alanlarda ve sýralama anahtarlarýndan önce gelen boþluklarý dikkate almaz -d, --dictionary-order anahtarlarda sadece [a-zA-Z0-9] karakterlerini dikkate alýr -f, --ignore-case sýralarken büyük/küçük harf farklýlýklarýný dikkate almaz

source: -g, --general-numeric-sort compare according to general numerical value -i, --ignore-nonprinting consider only printable characters -M, --month-sort compare (unknown) < `JAN' < ... < `DEC' -n, --numeric-sort compare according to string numerical value -r, --reverse reverse the result of comparisons
tr: -g, --general-numeric-sort sayýsal deðere bakarak sýralar, -n seçeneðini de de verilmiþ kabul eder ( -n seçeneðinden farký : 1.e-3 gibi sayýlarý da okuyabilir. -n seçeneðinden çok daha yavaþ çalýþýr, gerekmedikçe bu seçeneði kullanmayýn) -i, --ignore-nonprinting anahtarlarda sadece yazýlabilir (yazýlabilir = printable, Örnekler: a ? < , ...) karakterleri dikkate alýr -M, --month-sort anahtarýn ilk üç harfini alýr, bir ay ismi nin kýsaltmasýysa, aylarýn sýrasýna göre sýralar. Ay isimlerinin kýsa yazýlýþ- larýný LC_TIME çevre deðiskeninin belirttigi locale dosyasýndan bakar (çevre deðiþkeni = environment variable) -n, --numeric-sort sayýsal deðerlere göre sýralar -r, --reverse tersine sýralar
