Repository: bragin/syllable
Catalog: system/apps/gnu/textutils-2.0.21/po/*.po
Languages: tr

source: -L, --max-line-length print the length of the longest line -w, --words print the word counts
tr: -L, --max-line-length en uzun satýrýn uzunluðunu yazar -w, --words kelime sayýsýný yazar

source: total
tr: toplam
