Repository: bragin/syllable
Catalog: system/apps/gnu/textutils-2.0.21/po/*.po
Languages: tr

source: Other options: -c, --check check whether input is sorted; do not sort -k, --key=POS1[,POS2] start a key at POS1, end it at POS 2 (origin 1) -m, --merge merge already sorted files; do not sort -o, --output=FILE write result to FILE instead of standard output -s, --stable stabilize sort by disabling last-resort comparison -S, --buffer-size=SIZE use SIZE for main memory buffer
tr: Diger seçenekler: -c, --check dosyalar sýralý mý kontrol eder; sýralamaz -k, --key=POS1[,POS2] Sýralama anahtarý belirtmek için kullanýlan seçenek: POS1 de baþlayan POS2 de biten bir anahtar belirler (alan numarasýný ve karakterin kelime içindeki yerini 1'den baþlayarak sayar) -m, --merge sýralama yapma; daha önceden sýralanmýþ dosyalarý birleþtirir -o, --output=DOSYA sonucu DOSYA'ya yazar -s, --stable Eðer tüm satýrlar karþýlaþtýrýldýklarýnda eþit gözüküyorlarsa dosyayý ayný býrakýr (bu seçenek kullanýlmadýðýnda sort yukarda belirtilen durumla karþýlaþtýðýnda satýrlarý baþtan sona bayt bayt karþýlaþtýrýr) -S, --buffer-size=SAYI ana bellekten SAYI geniþliðinde alan kullanýr

source: -t, --field-separator=SEP use SEP instead of non- to whitespace transition -T, --temporary-directory=DIR use DIR for temporaries, not $TMPDIR or %s multiple options specify multiple directories -u, --unique with -c: check for strict ordering otherwise: output only the first of an equal run
tr: -t, --field-seperator=SEP kelimeleri boþluk yerine SEP ile ayrýlmýþ kabul eder -T, --temporary-directory=DIR geçici dizin olarak $TMPDIR veya %s yerine DIR'ý kullanýr. -u, --unique -c ile kullanýldýðýnda girdide her satýrýn özgün olup olmadýðýný da kontrol eder. -c ile kullanýlmadýðýnda sýralama yaparken ayný olan satýrlardan sadece birini yazar

source: -z, --zero-terminated end lines with 0 byte, not newline
tr: -z, --zero-terminated satýrlarý satýr-sonu karakteri (\n) yerine 0'la (0 baytý) bitirir

source: POS is F[.C][OPTS], where F is the field number and C the character position in the field. OPTS is one or more single-letter ordering options, which override global ordering options for that key. If no key is given, use the entire line as the key. SIZE may be followed by the following multiplicative suffixes:
tr: Sýralama anahtarlarý POS1, POS2 argümanlarý F[.C][SEC] ile belirtilir. Burda F alan numarasý C de karakterin alandaki yeridir.-k seçeneði verildiðinde alan numarasý ve karakterine alandaki yeri 1'den baþlanarak sayýlýr (eski kullaným þeklinde 0'dan baþlanarak sayýlýr). SEC ise yukarda belirtilen sýralama seçeneklerinden oluþur. (Hem en baþta hem POS1 veya POS2 nin içinde sýralama seçeneði belirtilmiþse POS1, POS2 nin içindekiler kullanýr). Anahtar belirtilmemiþse sort bütün satýrý anahtar olarak kullanýr. SAYI'dan sonra aþaðýdaki soneklerden biri gelebilir:

source: % 1% of memory, b 1, K 1024 (default), and so on for M, G, T, P, E, Z, Y. With no FILE, or when FILE is -, read standard input. *** WARNING *** The locale specified by the environment affects sort order. Set LC_ALL=C to get the traditional sort order that uses native byte values.
tr: %%(hafýzayý yüzdeyle belirtmek için) , b, k (varsayýlan), M, G, T, P, E, Z, Y. DOSYA verilmediðinde veya - olduðunda standart girdiden okur. *** UYARI *** Çevre deðiþkenlerince belirlenen locale dosyasý sýralamayý etkiler. bayt deðerlerine göre sýralama için LC_ALL çevre deðiþkenine C deðerini atayýn.

source: cannot create temporary file
tr: geçici dosya oluþturulamadý

source: open failed
tr: açma iþlemi baþarýsýz

source: close failed
tr: kapatma iþlemi baþarýsýz

source: write failed
tr: yazma baþarýsýz oldu

source: sort size
tr: sýralama boyu

source: stat failed
tr: stat baþarýsýz

source: read failed
tr: okuma baþarýsýz oldu

source: %s: %s:%s: disorder:
tr: %s: %s:%s: sýrasýz:

source: standard error
tr: standart hata

source: %s: invalid field specification `%s'
tr: %s: geçersiz alan tanýmý `%s'

source: %s: count `%.*s' too large
tr: %s: `%.*s' sayýmý fazla büyük

source: %s: invalid count at start of `%s'
tr: %s: `%s' baþlangýcýnda geçersiz sayým

source: invalid number after `-'
tr: `-' den sonra geçersiz sayý

source: invalid number after `.'
tr: `.' dan sonra geçersiz sayý

source: stray character in field spec
tr: alan tanýmýnda fazla harf

source: invalid number at field start
tr: alan baþlangýcýnda geçersiz sayý

source: field number is zero
tr: alan numarasý sýfýr

source: character offset is zero
tr: sýralama anahtarýnda belirtilen karakter yeri sýfýr

source: invalid number after `,'
tr: `,' den sonra geçersiz sayý

source: multi-character tab `%s'
tr: tab yerine kullanýlacak `%s' bir karakterden oluþmalý

source: extra operand `%s' not allowed with -c
tr: -c seçeneði kullanýldýðýnda sort sadece bir dosyayla çalýþýr : `%s' fazla

source: Usage: %s [OPTION] [INPUT [PREFIX]]
tr: Kullaným: %s [SEÇENEK] [GÝRDÝ [ÖNEK]]

source: Output fixed-size pieces of INPUT to PREFIXaa, PREFIXab, ...; default PREFIX is `x'. With no INPUT, or when INPUT is -, read standard input.
tr: GIRDI'yi eþit büyüklükte parçalara bölüp ONEKaa, ONEKab, ... isimli dosyalara kor. ONEK belirtilmediðinde parça isimleri `x' ile baþlar. GIRDI belirtilmediðinde veya - olduðunda standart girdiyi kullanýr

source: creating file `%s'
tr: dosya `%s' oluþturuluyor

source: cannot split in more than one way
tr: -C -l -b seçenekleri beraber kullanýlmaz

source: %s: invalid number of bytes
tr: %s: geçersiz bayt sayýsý

source: %s: invalid number of lines
tr: %s: geçersiz satýr sayýsý

source: invalid number
tr: geçersiz sayý

source: too many arguments
tr: çok fazla argüman

source: Kayvan Aghaiepour and David MacKenzie
tr: Kayvan Aghaiepour ve David MacKenzie

source: Print checksum and block counts for each FILE. -r defeat -s, use BSD sum algorithm, use 1K blocks -s, --sysv use System V sum algorithm, use 512 bytes blocks
tr: Her DOSYA'nýn saðlama toplamýný ve blok sayýsýný yazar. -r BSD toplama algoritmasýný kullanýr, blok geniþliðini 1K alýr -s, --sysv System V toplama algoritmasýný kullanýr, blok geniþliðini 512 bayt alýr

source: --help display this help and exit
tr: --help bu yardýmý gösterir ve çýkar

source: --version output version information and exit
tr: --version sürüm bilgisini gösterir ve çýkar

source: Jay Lepreau and David MacKenzie
tr: Jay Lepreau ve David MacKenzie

source: Write each FILE to standard output, last line first. With no FILE, or when FILE is -, read standard input.
tr: DOSYAlarý baþtan sona yazar ( son satýr ilk). DOSYA belirtilmediðinde veya - olduðunda standart girdiden okur.

source: -b, --before attach the separator before instead of after -r, --regex interpret the separator as a regular expression -s, --separator=STRING use STRING as the separator instead of newline
tr: -b, --before ayracý satýrdan sonra deðil, satýrdan önce koyar -r, --regex ayracý düzenli ifade olarak kabul eder (regex = regular expression (düzenli ifade)) -s, --seperator=AYRAC satýrlarý `\n' yerine AYRAC ile ayýr

source: stdin: read error
tr: standart girdi: okuma hatasý

source: separator cannot be empty
tr: -s 'ten sonra AYRAC belirtilmeli

source: Print the last %d lines of each FILE to standard output. With more than one FILE, precede each with a header giving the file name. With no FILE, or when FILE is -, read standard input.
tr: Belirtilen her DOSYA'nýn son %d satýrýný standart çýktýya yazar. Dosya ismi belirtilmediðinde veya - olduðunda standart girdiden okur.

source: --retry keep trying to open a file even if it is inaccessible when tail starts or if it becomes inaccessible later -- useful only with -f -c, --bytes=N output the last N bytes
tr: --retry belirtilen dosya ulaþýlamaz hale geldiðinde dosya tekrar okunabilir olana kadar bekler -c, --bytes=SAYI son SAYI baytý gösterir

source: -f, --follow[={name|descriptor}] output appended data as the file grows; -f, --follow, and --follow=descriptor are equivalent -F same as --follow=name --retry
tr: -f, --follow[={name|descriptor}] dosyayý sürekli izler, yeni satýrlar eklendikçe onlarý da çýktýya yazar. --follow=name dosya ismini kullanarak izler,--follow=descriptor dosya açýldýðýnda sistemin döndüðü dosya descriptor'ýný kullanarak izler. -F --follow=name --retry 'ýn aynýsý

source: -n, --lines=N output the last N lines, instead of the last %d --max-unchanged-stats=N with --follow=name, reopen a FILE which has not changed size after N (default %d) iterations to see if it has been unlinked or renamed (this is the usual case of rotated log files)
tr: -n, --lines=SAYI son %d satýr yerine son SAYI satýrý yazar --max-unchanged-stats=N --follow=name seçeneði kullanýldýðýnda N denemeden sonra DOSYA'da bir deðisiklik gözlemlememiþse silinip silinmediðini veya isminin deðistiril- mediðinden emin olmak için DOSYA'yý tekrar açar (bu seçenek kullanýlmadýðýnda %d defa bu iþi yapar)

source: --pid=PID with -f, terminate after process ID, PID dies -q, --quiet, --silent never output headers giving file names -s, --sleep-interval=S with -f, each iteration lasts approximately S (default 1) seconds -v, --verbose always output headers giving file names
tr: --pid=PID -f ile kullanýlýr. Proses numarasý PID olan proses öldükten sonra çýkar -q, --quiet, --silent dosya isimlerini yazmaz -s, --sleep-interval=S -f ile kullanýlýr. Dosyaya birþey yazýlýp yazýl- madýðý S saniye aralýklarla kontrol eder -v, --verbose dosya isimlerini yazar

source: With --follow (-f), tail defaults to following the file descriptor, which means that even if a tail'ed file is renamed, tail will continue to track its end.
tr: --follow (-f) seçeneðinde [=name] belirtilmedikçe, dosya descriptor'ýný kullanarak dosyayý izler. Böylelikle dosyanýn ismi deðiþse bile dosyayý izlemeye devam eder.

source: closing %s (fd=%d)
tr: %s kapatýlýyor (fd=%d)

source: %s: cannot seek to offset %s%s
tr: %s:dosya'da %s%s'e kadar ilerleme (seek) baþarýsýz

source: %s: cannot seek to relative offset %s%s
tr: %s:dosyada %s%s ilerlemek (seek) baþarýsýz

source: %s: cannot seek to end-relative offset %s%s
tr: %s: dosyanýn sonundan %s%s kadar geriye gitmek (seek) baþarýsýz

source: `%s' has become inaccessible
tr: `%s' dosyasý okunamaz hale geldi

source: `%s' has been replaced with an untailable file; giving up on this name
tr: `%s' ismi artýk izlenemeyecek bir dosyaya ait

source: `%s' has become accessible
tr: `%s' dosyasý tekrar okunabilir hale geldi

source: `%s' has appeared; following end of new file
tr: `%s' ortaya çýktý; yeni dosyanýn sonu takip ediliyor

source: `%s' has been replaced; following end of new file
tr: `%s' tekrar okunabilir hale geldi; yeni dosyayý izlemeye devam

source: %s: file truncated
tr: %s: dosya kýsaldý

source: no files remaining
tr: üzerinde çalýþabilecek dosya kalmadý

source: %s: cannot follow end of this type of file; giving up on this name
tr: %s: tail bu çeþit dosyayý takip edemez

source: %c: invalid suffix character in obsolescent option
tr: %c: eski kullaným þeklindeki seçenekte geçersiz ek

source: too many arguments; When using tail's obsolescent option syntax (%s) there may be no more than one file argument. Use the equivalent -n or -c option instead.
tr: gereðinden fazla argüman; eski kullaným þeklindeki seçenekle (%s) beraber sadece bir dosya ismi verilebilir. Eski þekil yerine -n veya -c seçeneklerini kullanýn.

source: Warning: it is not portable to use two or more file arguments with tail's obsolescent option syntax (%s). Use the equivalent -n or -c option instead.
tr: Uyarý: eski kullaným þeklindeki seçenekle (%s) beraber sadece bir dosya ismi verilebilir. Eski þekil yerine -n veya -c seçeneklerini kullanýn.

source: %s: is so large that it is not representable
tr: %s: bu sistem için bu sayý çok büyük

source: %s is larger than the maximum file size on this system
tr: %s bu sistemdeki maksimum dosya boyundan daha büyük

source: %s: invalid maximum number of unchanged stats between opens
tr: %s:--max-unchanged-stats seçeneðiyle verilen argüman geçersiz

source: %s: invalid maximum number of consecutive size changes
tr: %s: --max-consecutive-size-changes seçeneðiyle verilen argüman geçersiz

source: %s: invalid PID
tr: %s: geçersiz PID

source: %s: invalid number of seconds
tr: %s: geçersiz saniye sayýsý

source: warning: --retry is useful only when following by name
tr: uyarý: --retry seçeneði sadece --follow=name seçeneðiyle kullanýldýðýnda bir anlam taþýr

source: warning: PID ignored; --pid=PID is useful only when following
tr: uyarý: --pid=PID sadece -f seçeneðiyle kullanýldýðýnda bir anlam taþýr

source: warning: --pid=PID is not supported on this system
tr: uyarý: --pid=PID bu sistemde desteklenmiyor

source: Usage: %s [OPTION]... SET1 [SET2]
tr: Kullaným: %s [SEÇENEK]... KÜME1 [KÜME2]

source: Translate, squeeze, and/or delete characters from standard input, writing to standard output. -c, --complement first complement SET1 -d, --delete delete characters in SET1, do not translate -s, --squeeze-repeats replace sequence of characters with one -t, --truncate-set1 first truncate SET1 to length of SET2
tr: Standart girdiden okuduðu karakterleri çevirerek, sýkýþtýrarak ve/veya silerek standart çýktýya yazar -c, --complement KUME1'in tümleyicisi -d, --delete KUME1'deki karakterleri siler, çeviri yapmaz -s, --squeeze-repeats ayný karakterden oluþmus sýrayi siler yerine o karaketerden bir tane koyar -t, --truncate-set1 ilk önce KUME1'i, KUME2'nin boyuna eþit olacak þekilde kýsaltýr

source: SETs are specified as strings of characters. Most represent themselves. Interpreted sequences are: \NNN character with octal value NNN (1 to 3 octal digits) \\ backslash \a audible BEL \b backspace \f form feed \n new line \r return \t horizontal tab
tr: KUMEler burada karakter dizgeleri anlamýndadýr. anlamlý olan sýralamalar aþaðýdadýr: \NNN NNN (1-3 tane sekizlik basamak ) sekizlik deðeri olan karakter \\ ters kesik \a bip sesi \b geri git \f form ilerletme \n yeni satýr \r satýr baþý \t enine tab

source: \v vertical tab CHAR1-CHAR2 all characters from CHAR1 to CHAR2 in ascending order [CHAR*] in SET2, copies of CHAR until length of SET1 [CHAR*REPEAT] REPEAT copies of CHAR, REPEAT octal if starting with 0 [:alnum:] all letters and digits [:alpha:] all letters [:blank:] all horizontal whitespace [:cntrl:] all control characters [:digit:] all digits
tr: \v boyuna tab KAR1-KAR2 büyükten küçüðe KAR1 den KAR2 ye kadarki tüm karakterler [KAR*] KUME2'de kullanýlýr:KUME1'in boyuna gelene kadar KAR'ýn tekrarý [KAR*TEKRAR] KAR'ýn TEKRAR kere tekrarý, TEKRAR 0 ile baþlýyorsa sekizlik sayý olarak algýlanýr [:alnum:] tüm harf ve rakamlar [:alpha:] tüm harfler [:blank:] tüm enine boþluklar [:cntrl:] tüm kontrol karakterleri [:digit:] tüm rakamlar

source: [:graph:] all printable characters, not including space [:lower:] all lower case letters [:print:] all printable characters, including space [:punct:] all punctuation characters [:space:] all horizontal or vertical whitespace [:upper:] all upper case letters [:xdigit:] all hexadecimal digits [=CHAR=] all characters which are equivalent to CHAR
tr: [:graph:] boþluk hariç, tüm yazýlabilir karakterler [:lower:] tüm küçük harfler [:print:] boþluk dahil, tüm yazýlabilir karakterler [:punct:] tüm noktalama isaretleri [:space:] tüm enine veya boyuna boþluklar [:upper:] tüm büyük harfler [:xdigit:] tüm onaltýlýk sistem rakamlarý [=KAR=] KAR'a eþ olan tüm karakterler

source: Translation occurs if -d is not given and both SET1 and SET2 appear. -t may be used only when translating. SET2 is extended to length of SET1 by repeating its last character as necessary.
tr: Çeviri,-d seçeneði kullanýlmadýðýnda ve KUME1 ve KUME2 nin her ikisi de verildiðinde gerçekleþir.-t sadece çeviri yaparken kullanýlabilir. KUME2 gerektiðinde son karakteri tekrar edilerek KUME1 ile ayný uzunluða getirilir.

source: Excess characters of SET2 are ignored. Only [:lower:] and [:upper:] are guaranteed to expand in ascending order; used in SET2 while translating, they may only be used in pairs to specify case conversion.
tr: SET2'deki gereðinden fazla karakterler dikkate alýnmaz. Çeviri yapýlýlýrken KUME2 de kullanýlan karakter sýnýflarýndan sadece [:lower:] ve [:upper:] kesin olarak büyükten küçüðe açýlýrlar, bu ikisi beraberce sadece büyük harf küçük harf deðisimi yapýlýlrken kullanýlabilir. -s sadece KUME1'i kullanýr.

source: -s uses SET1 if not translating nor deleting; else squeezing uses SET2 and occurs after translation or deletion.
tr: -s sadece çeviri veya sýkýþtýrmayla beraber çalýþýyorsa KUME2 yi kullanýr ve çeviri veya sýkýþtýrma bittikten sonra devreye girer.

source: warning: the ambiguous octal escape \%c%c%c is being interpreted as the 2-byte sequence \0%c%c, `%c'
tr: uyarý: net olmayan \%c%c%c sekizlik ters kesik gösteririmi \0%c%c,`%c' sýrasý olarak algýlanýyor

source: invalid backslash escape at end of string
tr: dizge sonunda geçersiz terskesik gösterimi

source: invalid backslash escape `\%c'
tr: geçersiz terskesik gösterimi `\%c'

source: range-endpoints of `%s-%s' are in reverse collating sequence order
tr: alan sýnýrlarý '%s-%s' ters sýralýlar

source: invalid repeat count `%s' in [c*n] construct
tr: '%s' de geçersiz [c*n] tekrar yapýsý

source: missing character class name `[::]'
tr: `[:' ile `:]' arasýnda bir eþitlik sýnýfý belirtilmeli

source: missing equivalence class character `[==]'
tr: `[=' ile `=]' arasýnda bir eþitlik sýnýfý belirtilmeli

source: invalid character class `%s'
tr: geçersiz karakter sýnýfý `%s'

source: %s: equivalence class operand must be a single character
tr: %s: eþitlik sýnýfý (equivalance class)operandý tek karakterden oluþmalýdýr

source: the [c*] repeat construct may not appear in string1
tr: [c*] tekrar yapýsý KUME1'de bulunamaz

source: only one [c*] repeat construct may appear in string2
tr: KUME2'de yalnýzca bir [c*] tekrar yapýsý olabilir

source: [=c=] expressions may not appear in string2 when translating
tr: KUME2'de çeviri yaparken [=c=] ifadeleri yer alamaz

source: when not truncating set1, string2 must be non-empty
tr: KUME1 kýsaltýlmýyorsa KUME2 boþ olamaz

source: when translating with complemented character classes, string2 must map all characters in the domain to one
tr: karakter sýnýflarýnýn tümleyicileri (küme tümleyen=set complement) kullanýldýðýnda KUME2 sadece bir karakter kullanan ifadeler içerebilir

source: when translating, the only character classes that may appear in string2 are `upper' and `lower'
tr: çeviri yaparken, KUME2'de kullanýlabilecek karakter sýnýflarý: upper, lower

source: the [c*] construct may appear in string2 only when translating
tr: [c*] ifadesi KUME2'de sadece çeviri yaparken kullanýlabilir

source: two strings must be given when translating
tr: çevrim için iki KUME verilmelidir

source: two strings must be given when both deleting and squeezing repeats
tr: tekrar edilen karakterler bire indirgeme ve silme beraber yapýlýlrken iki KUME verilmeli

source: only one string may be given when deleting without squeezing repeats
tr: tekrar edilen karakterler bire indirgenMEden silme yapýlýyorsa sadece bir KUME verilmeli

source: at least one string must be given when squeezing repeats
tr: tekrar eden karakterler bire indirgenirken en azýndan bir KUME verilmeli

source: misaligned [:upper:] and/or [:lower:] construct
tr: ayarlanmamýþ veya uymayan [:upper:] ve/veya [:lower:] ifadesi

source: invalid identity mapping; when translating, any [:lower:] or [:upper:] construct in string1 must be aligned with a corresponding construct ([:upper:] or [:lower:], respectively) in string2
tr: çeviri yaparken KUME1'de [:lower:] kullanmýþsanýz KUME2'de [:upper:] KUME1'de [:upper:] kullanmýþsanýz KUME2'de [:lower:] kullanmanýz lazým

source: Usage: %s [OPTION] [FILE] Write totally ordered list consistent with the partial ordering in FILE. With no FILE, or when FILE is -, read standard input.
tr: Kullaným: %s [SECENEK] [DOSYA] DOSYA'daki kýsmi sýralamayý (kýsmi sýralama=partial ordering, matematiksel bir terim) göz önüne alarak DOSYA'nýn tam sýralý (tam sýralý = totally ordered, matematiksel terim) halini çýktýya yazar. (tsort = topological sort, topolojik sýralama)

source: %s: input contains a loop:
tr: %s: girdide bir döngü (döngü=loop, Graph Teorideki anlamýnda) var

source: only one argument may be specified
tr: yalnýz bir argüman verilebilir

source: Convert spaces in each FILE to tabs, writing to standard output. With no FILE, or when FILE is -, read standard input.
tr: DOSYA'daki boþluklarý tab'a çevirir ve standard çýktýya yazar. DOSYA belirtilmediðinde veya - olduðunda standard girdiden okur.

source: -a, --all convert all whitespace, instead of initial whitespace -t, --tabs=NUMBER have tabs NUMBER characters apart instead of 8 -t, --tabs=LIST use comma separated list of explicit tab positions
tr: -a, --all tüm boþluklarý dikkate alýr -t, --tabs=SAYI tab geniþliði 8 deðil SAYI olarak alýr -t, --tabs=LISTE virgüllerle ayrýlmýþ tab pozisyonlarý listesini kullanarak çeviri yapar

source: Usage: %s [OPTION]... [INPUT [OUTPUT]]
tr: Kullaným: %s [SEÇENEK]... [GÝRDÝ [ÇIKTI]]

source: Discard all but one of successive identical lines from INPUT (or standard input), writing to OUTPUT (or standard output).
tr: GIRDI'deki (veya standart girdi) arka arkaya gelen ayný satýrlardan sadece ilkini CIKTI'ya (veya standart çýktý) yazar

source: -c, --count prefix lines by the number of occurrences -d, --repeated only print duplicate lines
tr: -c, --count her satýr baþýna tekrar sayýsýný yazar -d, --repeated sadece aynýsýndan iki tane olan satýrlarý gösterir

source: -D, --all-repeated[=delimit-method] print all duplicate lines delimit-method={none(default),prepend,separate} Delimiting is done with blank lines. -f, --skip-fields=N avoid comparing the first N fields -i, --ignore-case ignore differences in case when comparing -s, --skip-chars=N avoid comparing the first N characters -u, --unique only print unique lines
tr: -D --all-repeated[=delimit-method] sadece birden fazla olan satýrlarý yazar delimit-method þu deðerleri alabilir: none: satýrlarý ayýrmaz (delimit-method belirtilmediðinde none kullanýlýr) prepend: her satýr grubunun baþýna boþluk koyar separate: satýr gruplarýnýn arasýna boþluk koyar -f, --skip-fields=N ilk N alaný karþýlaþtýrmaz -i, --ignore-case büyük/küçük harf farklýlýklarýný dikkate almaz -s, --skip-chars=N ilk N karakteri karþýlaþtýrmaz -u, --unique sadece özgün satýrlarý karþýlaþtýr

source: A field is a run of whitespace, then non-whitespace characters. Fields are skipped before chars.
tr: Aralýksýz devam eden boþluklara alan denir -s ve -f seçenekleri kullanýldýðýnda alanlar karakterlerden önce atlanýr.

source: error reading %s
tr: %s'i okunurken hata

source: error writing %s
tr: %s'e yazarken hata

source: extra operand `%s'
tr: `%s' operandý fazla

source: invalid number of fields to skip
tr: atlanacak alan sayýsý geçersiz

source: invalid number of bytes to skip
tr: atlanacak bayt sayýsý geçersiz

source: invalid number of bytes to compare
tr: karþýlaþtýrýlacak bayt sayýsý geçersiz

source: printing all duplicated lines and repeat counts is meaningless
tr: hem ayný olan satýrlarýn yazýlmasýna izin vermek hem de ayný olan satýrlarýn sayýsýný yazdýrmak anlamsýz

source: Paul Rubin and David MacKenzie
tr: Paul Rubin ve David MacKenzie

source: Print newline, word, and byte counts for each FILE, and a total line if more than one FILE is specified. With no FILE, or when FILE is -, read standard input. -c, --bytes print the byte counts -m, --chars print the character counts -l, --lines print the newline counts
tr: Eðer birden fazla DOSYA ismi verilmiþse hepsi için satýr kelime ve bayt sayýlarýný yazar. Eðer hiç DOSYA ismi verilmemiþ veya DOSYA - ise standart girdiden okur. -c, --bytes bayt sayýsýný yazar -m, --chars karakter sayýsýný yazar -l, --lines satýr sayýsýný (\n sayýsý) yazar
